import { describe, expect, it } from 'vitest'
import { hira2Kana, kana2Hira } from '~~/libs/TypingJapaneseChars'

describe('TypingJapaneseChars', () => {
  describe('hira2Kana', () => {
    const sut = hira2Kana
    it.each<[string, string]>([
      ['', ''],
      ['あいうえお', 'アイウエオ'],
      ['かきくけこ', 'カキクケコ'],
      ['さしすせそ', 'サシスセソ'],
      ['たちつてと', 'タチツテト'],
      ['なにぬねの', 'ナニヌネノ'],
      ['はひふへほ', 'ハヒフヘホ'],
      ['まみむめも', 'マミムメモ'],
      ['やゆよ', 'ヤユヨ'],
      ['らりるれろ', 'ラリルレロ'],
      ['わゐゑをん', 'ワヰヱヲン'],
      ['がぎぐげご', 'ガギグゲゴ'],
      ['ざじずぜぞ', 'ザジズゼゾ'],
      ['だぢづでど', 'ダヂヅデド'],
      ['ばびぶべぼ', 'バビブベボ'],
      ['ぱぴぷぺぽ', 'パピプペポ'],
      ['ぁぃぅぇぉ', 'ァィゥェォ'],
      ['ゕゖっ', 'ヵヶッ'],
      ['ゃゅょ', 'ャュョ'],
      ['あIうEお', 'アIウEオ'],
    ])('$0は$1', (input, expected) => {
      expect(sut(input)).toBe(expected)
    })
  })

  describe('kana2Hira', () => {
    const sut = kana2Hira
    it.each<[string, string]>([
      ['', ''],
      ['アイウエオ', 'あいうえお'],
      ['カキクケコ', 'かきくけこ'],
      ['サシスセソ', 'さしすせそ'],
      ['タチツテト', 'たちつてと'],
      ['ナニヌネノ', 'なにぬねの'],
      ['ハヒフヘホ', 'はひふへほ'],
      ['マミムメモ', 'まみむめも'],
      ['ヤユヨ', 'やゆよ'],
      ['ラリルレロ', 'らりるれろ'],
      ['ワヰヱヲン', 'わゐゑをん'],
      ['ガギグゲゴ', 'がぎぐげご'],
      ['ザジズゼゾ', 'ざじずぜぞ'],
      ['ダヂヅデド', 'だぢづでど'],
      ['バビブベボ', 'ばびぶべぼ'],
      ['パピプペポ', 'ぱぴぷぺぽ'],
      ['ァィゥェォ', 'ぁぃぅぇぉ'],
      ['ヵヶッ', 'ゕゖっ'],
      ['ャュョ', 'ゃゅょ'],
      ['アIウEオ', 'あIうEお'],
    ])('$0は$1', (input, expected) => {
      expect(sut(input)).toBe(expected)
    })
  })
})
