{
  "id": "00001",
  "title": "アリとキリギリス",
  "type": "english",
  "tags": [
    {
      "id": "00001",
      "name": "英語"
    },
    {
      "id": "00002",
      "name": "イソップ童話"
    }
  ],
  "createdAt": "2021-05-31",
  "updatedAt": "2021-05-31",
  "words": [
    {
      "info": "アリとキリギリス",
      "word": "The Ants and the Grasshopper"
    },
    {
      "info": "なつ の ある ひ、キリギリス が のはら で うた を うたって いると、アリ たち が ぞろぞろ あるいて きました。",
      "word": "One day in summer, when a grasshopper was singing in the grassy meadow, a group of ants walked by."
    },
    {
      "info": "「おい、アリくん たち。そんな に あせ を びっしょり かいて、なに を してるんだい？」",
      "word": "\"Hello, dear ants. What are you doing drenched in sweat?\""
    },
    {
      "info": "「これは キリギリスさん、わたしたち は たべもの を はこんで いるんですよ」",
      "word": "\"Hello, grasshopper. We are conveying food.\""
    },
    {
      "info": "「ふーん。だけど、ここ には たべもの が いっぱい ある じゃないか。",
      "word": "\"Hmm... I see. But as you can see, there is plenty of food around here."
    },
    {
      "info": "どうして、いちいち いえ に たべもの を はこぶんだい。",
      "word": "Why do you have to convey food to your home one by one?"
    },
    {
      "info": "おれ みたい に、おなか が すいたら そのへん に ある もの を たべて、あと は たのしく うた を うたったり、あそんだり して いれば いいじゃないか」",
      "word": "Look at me. I eat things around here when I get hungry. I sing merrily or have fun for the rest of the time.\""
    },
    {
      "info": "「でもね。キリギリスさん。",
      "word": "\"Listen, grasshopper."
    },
    {
      "info": "いま は なつ だから たべもの が たくさん あるけど、ふゆ が きたら、ここ も たべもの は なくなって しまいますよ。",
      "word": "We have plenty of food right now because it's summer, but once winter comes, there will be no food to eat here."
    },
    {
      "info": "いま の うち に たくさん の たべもの を あつめて おかない と、あと で こまりますよ」",
      "word": "It is better to stock up food for winter or you may get in trouble later.\""
    },
    {
      "info": "アリたち が そう いう と、キリギリス は バカ に した ように、「ハハハハハハッ」と、わらって。",
      "word": "When the ants said so, the grasshopper laughed sniffily. \"Ha-ha-ha\" and he said,"
    },
    {
      "info": "「まだ なつ が はじまった ばっかり。ふゆ の こと は ふゆ が きて から かんがえれば いいのさ」",
      "word": "\"Summer time has just started. Think about winter when it arrives.\""
    },
    {
      "info": "そう こたえる と、また うた を うたい はじめました。",
      "word": "After that, he started to sing a song again."
    },
    {
      "info": "さて、それから も まいにち キリギリス は ようき に うたって くらし、アリたち は せっせ と いえ に たべもの を はこび ました。",
      "word": "The grasshopper kept enjoying his life singing merrily while the ants worked hard to convey food to the house."
    },
    {
      "info": "やがて なつ が おわり、あき が きました。",
      "word": "Before long, summer faded into autumn."
    },
    {
      "info": "キリギリス は、ますます ようき に うた を うたって います。",
      "word": "The grasshopper is singing much merrilier."
    },
    {
      "info": "そして とうとう、さむいさむい ふゆ が やって きました。",
      "word": "At last, a cold, cold winter has arrived."
    },
    {
      "info": "のはら の くさ は すっかり かれはて、キリギリス の たべもの は ひとつ も なくなって しまいました。",
      "word": "The grassy meadow has all gone and there is not a crumb to eat for the grasshopper."
    },
    {
      "info": "「ああ、おなか が すいたな。こまったな。どこか に たべもの は ないか なあ。",
      "word": "\"Ah... I am starving. It seems like I am in trouble. I have to find something to eat somewhere... Where shall I go?\""
    },
    {
      "info": "・・・あっ、そうだ。アリくん たち が、たべもの を たくさん あつめて いたっけ。",
      "word": "Let me see... Oh, here it is. I remember the ants were working hard to stock up food."
    },
    {
      "info": "よし、アリくん たち に なにか たべさせて もらおう」",
      "word": "Right, I shall go to the ants' and ask for food.\""
    },
    {
      "info": "キリギリス は いそいで アリ の いえ に やってきました が、アリ は いえ の なか から、",
      "word": "The grasshopper rushed to the ants', but the ant answered from the house,"
    },
    {
      "info": "「だから、たべもの が たくさん ある なつ の あいだ に たべもの を あつめて おきなさい と いった でしょう。",
      "word": "\"I told you to save some food during summer when there is plenty of food."
    },
    {
      "info": "いえ には かぞく の ぶん の たべもの しか ない から、わるい けど、キリギリスさん には あげる こと が できません」",
      "word": "All I have here is only for my family. I'm sorry but there is nothing for you.\""
    },
    {
      "info": "と、いって、げんかん を あけて くれません でした。",
      "word": "He said to the grasshopper without opening the door."
    },
    {
      "info": "キリギリス は ゆき の ふる のはら の まんなか で、さむさ に ふるえ ながら しょんぼり していました。",
      "word": "The grasshopper was disappointed and shivering in the middle of the snowy filed."
    },
    {
      "info": "いま、らく を している なまけもの は、そのうち いたいめ に あう と いう おはなし です。",
      "word": "If you are being lazy and having an easy life, you will get your fingers burnt in the meantime."
    },
    {
      "info": "おしまい",
      "word": "The end"
    }
  ]
}