import { hira2Kana } from '~~/libs/TypingUtil'

describe('hira2Kana', () => {
  it.each([
    ['', ''],
    ['あいうえお', 'アイウエオ'],
    ['かきくけこ', 'カキクケコ'],
    ['さしすせそ', 'サシスセソ'],
    ['たちつてと', 'タチツテト'],
    ['なにぬねの', 'ナニヌネノ'],
    ['はひふへほ', 'ハヒフヘホ'],
    ['まみむめも', 'マミムメモ'],
    ['やゆよ', 'ヤユヨ'],
    ['らりるれろ', 'ラリルレロ'],
    ['わゐゑをん', 'ワヰヱヲン'],
    ['がぎぐげご', 'ガギグゲゴ'],
    ['ざじずぜぞ', 'ザジズゼゾ'],
    ['だぢづでど', 'ダヂヅデド'],
    ['ばびぶべぼ', 'バビブベボ'],
    ['ぱぴぷぺぽ', 'パピプペポ'],
    ['ぁぃぅぇぉ', 'ァィゥェォ'],
    ['ゕゖっ', 'ヵヶッ'],
    ['ゃゅょ', 'ャュョ'],
    ['あIうEお', 'アIウEオ'],
  ])('$0 => $1', (input, expected) => {
    expect(hira2Kana(input)).toBe(expected)
  })
})
