import { kana2Hira } from '~~/libs/TypingUtil'

describe('kana2Hira', () => {
  it.each([
    ['', ''],
    ['アイウエオ', 'あいうえお'],
    ['カキクケコ', 'かきくけこ'],
    ['サシスセソ', 'さしすせそ'],
    ['タチツテト', 'たちつてと'],
    ['ナニヌネノ', 'なにぬねの'],
    ['ハヒフヘホ', 'はひふへほ'],
    ['マミムメモ', 'まみむめも'],
    ['ヤユヨ', 'やゆよ'],
    ['ラリルレロ', 'らりるれろ'],
    ['ワヰヱヲン', 'わゐゑをん'],
    ['ガギグゲゴ', 'がぎぐげご'],
    ['ザジズゼゾ', 'ざじずぜぞ'],
    ['ダヂヅデド', 'だぢづでど'],
    ['バビブベボ', 'ばびぶべぼ'],
    ['パピプペポ', 'ぱぴぷぺぽ'],
    ['ァィゥェォ', 'ぁぃぅぇぉ'],
    ['ヵヶッ', 'ゕゖっ'],
    ['ャュョ', 'ゃゅょ'],
    ['アIウEオ', 'あIうEお'],
  ])('$0 => $1', (input, expected) => {
    expect(kana2Hira(input)).toBe(expected)
  })
})
